[
  {
    "title": "3 way speaker loosely based on Toid's Dinas (Do I Need A Subwoofer)",
    "date": "2026-02-26",
    "content": "Nov 24'\n\n3 way speaker loosely based on Toid's Dinas (Do I Need A Subwoofer)\n\nThis was a complete design process, including the crossover build. The cabinets are birch fronted, MDF, I used a little maple to do the surrounds, this helped in terminating the maple veneer i used.\n\nAbout the speaker:\nI wanted to build a WAW (woofer assisted wideband) cabinet but this turned into a 3 way design with a difference... The 5.25 inch woofer is actually classed as a subwoofer and can achieve 35 hz and has a huge xmax of 12mm. The crossover points i shot for were 300hz (woofer to mid) and as the mid is actually a full range capable driver I crossed the 1 inch titanium tweeter around 5khz. I hoped these would sound big as a result. The cabinet design was done using WinISD and the crossover design done in VituixCAD. I'll be testing and measuring the responses soon. Watch this space for updates.\n\nThe speaker is similar to 123toid's Dinas speaker in that it uses the same mid/bass drivers. However i wanted a round port vented design and a different crossover characteristic . The cabinet interior volume all said is 11 litres. \n\nA valuable learning introduction to crossover building and testing.",
    "carouselPosition": "bottom",
    "gallery": [
      "/assets/images/1772116094665-20241215_173108.jpg",
      "/assets/images/1772116094790-20241124_144855.jpg",
      "/assets/images/1772116094815-20241119_081000.jpg",
      "/assets/images/1772116094882-20241110_161552.jpg",
      "/assets/images/1772116094949-20241113_202352.jpg",
      "/assets/images/1772116094985-20241118_191029.jpg",
      "/assets/images/1772116804091-screenshot_2026_02_26_143947.png"
    ]
  },
  {
    "title": "Weekend build. Downfiring dual 8 inch subwoofer",
    "date": "2026-02-26",
    "content": "Oct24'\n\nWeekend build. Downfiring dual 8 inch subwoofer for the van, on a trailing lead with speakon connectors so it can be moved around according to seat configurations. Using 2 x Dayton Audio DCS205-4 in parallell to 2ohms. Nice sounding box! 52 litre enclosure and port tuned to 36 hz.",
    "carouselPosition": "top",
    "gallery": [
      "/assets/images/1772115712679-20241012_122109.jpg",
      "/assets/images/1772115712770-20241012_120408.jpg",
      "/assets/images/1772115915884-20241012_112140.jpg"
    ]
  },
  {
    "title": "Dual 5.25 inch downfiring Sub",
    "date": "2026-02-26",
    "content": "March 24'\n\nDual 5.25in downfiring sub using 2 Tang Band 1138 SMF circa 25l box.\nThese small subwoofers really pack a punch and for their size this little sub really added some much needed low end in my van. Slot ported construction. calculated in winISD.",
    "carouselPosition": "top",
    "gallery": [
      "/assets/images/1772115510664-20240320_103203.jpg",
      "/assets/images/1772115510714-20240321_085343.jpg",
      "/assets/images/1772115510747-20240320_103323.jpg"
    ]
  },
  {
    "title": "Bluetooth Boombox with a Nixie clock",
    "date": "2026-02-26",
    "content": "Sept 24'\n\ni wanted to build a Bluetooth boombox, something that could run of either battery or mains (seperate circuits) Having already specced up the drivers and designed enclosures in WinISD, i sketched out a rough design and everything sort of evolved as it got built. Here are the first steps, i knew i wanted tweeters in pods to sit atop the main drivers, so i set to cutting out discs, gluing em up to make the pods.\n\nI wanted two discreet chambers for each channel, this would make the unit true stereo so in order to accomodate the electronics whilst having enough volume for the drivers, i made two L shaped cavities. I also wanted to have led lighting on each side, vu meters and an IN12 nixie clock for novelty purposes. \n\nOnce the cabinet was assembled i used some epoxy body filter to even out any imperfections, then gave everything a good sanding. By this stage I'd also prewired the led cob strips (i used clear perspex, sanded to a matte finish to cover the side led appertures) and as everything had to be airtight i sealed the led strips behind wooden covers on the rear of the faceplate. I have also pre wired the drivers and tweeters as these had to be sealed in also.\n\nI ended up using 'Duratex' textured finish paint, this is the stuff used on PA speakers and it gives a very tough professional finish.\n\nFrom the very start, i wanted to design the speaker with a Fallout/atom punk aesthetic, hence the nixie. Id intended to use heavy duty switch gear to complete the aesthetic as well as chunky carry handles. The box was constructed of MDF.\n\nA couple of months after i started the project, and following a couple of control panel itterations i completed the build. Im exceptionally happy with it too. The finish is great and the sound quality is genuinely fantastic, the electronics used were:\n*Dayton Audio 4x TCP 115-8 4 inch drivers (wired parelell in each side, in ported cabs tuned to 55hz\n*Dayton audio 2x TD20F tweeters\n*off the shelf 2 way crossovers.\n*Nobsound NS01-G bluetooth amplifier (tore down and modified) 50w PC\n\nInternally theres a seperate 230v - 24v dc psu\nA 6s 5p lithium battery (which i assembled) and is good for around 8 hours at 75% volume - which is insanely loud... These are both controlled on a changeover switch, the battery can be completely removed and it will still work on mains. The 12v LED cob strips are dimmable. The amplifier circuit can be switched on and off along with the VU meters, a line input socket is found on the rear as well as usb PD charging ports.\nThe IN12 Nixie clock is switched also.\n\nThe amplification runs on 24v with additional 12v and 5v circuits for the LEDs and Clock.\n\nFinally, I designed the control panel in a PCB Cad app and had JLC PCB fabricate me a minimum order of 5 panels which were shipped from china for about £11. Switch gear was finished with aircraft stye toggles which make a satisfying clunk when used.\n\nAnd to finish the outside, my good friend 3D printed a Vault-Tec (from the Fallout video game franchise) emblem which i placed on the front to complete the aesthetic i was going for...Anybody who knows me is aware i love the Fallout world with a passion!",
    "carouselPosition": "top",
    "gallery": [
      "/assets/images/1772110172372-20240623_190353.jpg",
      "/assets/images/1772110172445-20240623_172344.jpg",
      "/assets/images/1772110172473-20240906_173216.jpg",
      "/assets/images/1772110172555-videocapture_20250111_165101.jpg"
    ]
  },
  {
    "title": "Welcome to the blog!",
    "date": "2026-02-25",
    "content": "Here, i'll document some of my loudspeaker builds during and after construction. As ive done many builds prior to this blog going live, i'll document them in the first couple of posts. The build range from 2022 to present day.\n\nJuly 23'\n\nThe first real build i did was a pair of compact bookshelf speakers, these were built with 'Amazon special' drivers and an off the shelf crossover, I constructed the cabinets after running the numbers through some basic online calculators... no winISD at this time. I didnt even have the TS params for the 4 inch fiberglass drivers... But they sounded OK, i tweaked the port a couple of times and even though i didnt do the maths proper, i was impressed by the sound. At least i constructed the solid fonts from walnut strips and the finish was great for my first build.",
    "carouselPosition": "top",
    "gallery": [
      "/assets/images/1772056381400-whatsapp_image_2026_02_25_at_21.51.16.jpeg",
      "/assets/images/1772056381427-whatsapp_image_2026_02_25_at_21.50.54.jpeg",
      "/assets/images/1772056381449-whatsapp_image_2026_02_25_at_21.50.34.jpeg",
      "/assets/images/1772056381467-whatsapp_image_2026_02_25_at_21.50.15__1_.jpeg",
      "/assets/images/1772056547956-whatsapp_image_2026_02_25_at_21.51.34.jpeg"
    ]
  }
]